[
  {
    "title": "Chainsaw Man",
    "desc": "Denji is a teenage boy living with a Chainsaw Devil named Pochita. Due to the debt his father left behind, he has been living a rock-bottom life while repaying his debt by harvesting devil corpses with Pochita. One day, Denji is betrayed and killed. As his consciousness fades, he makes a contract with Pochita and gets revived as \"Chainsaw Man\" — a man with a devil's heart.",
    "numOfEp": 12,
    "numOfSeasons": 1,
    "type": "TV",
    "shortCode": "CM",
    "rating": 86,
    "year": 2022,
    "studio": "MAPPA",
    "genres":[
      "ACTION",
      "COMEDY",
      "DRAMA",
      "HORROR",
      "SUPERNATURAL"
    ]
  },
  {
    "title": "One Piece",
    "desc": "Enter Monkey D. Luffy, a 17-year-old boy that defies your standard definition of a pirate. Rather than the popular persona of a wicked, hardened, toothless pirate who ransacks villages for fun, Luffy’s reason for being a pirate is one of pure wonder; the thought of an exciting adventure and meeting new and intriguing people, along with finding One Piece, are his reasons of becoming a pirate. Following in the footsteps of his childhood hero, Luffy and his crew travel across the Grand Line, experiencing crazy adventures, unveiling dark mysteries and battling strong enemies, all in order to reach One Piece.",
    "numOfEp": 1054,
    "numOfSeasons": 1,
    "type": "TV",
    "shortCode": "OP",
    "rating": 87,
    "year": 1999,
    "studio": "TOEI",
    "genres":[
      "ACTION",
      "ADVENTURE",
      "COMEDY",
      "DRAMA",
      "FANTASY"
    ]
  },
  {
    "title": "Overlord",
    "desc": "The story takes place in the year 2138 when virtual reality gaming is booming. Yggdrasil, a popular online game is quietly shut down one day. However, the protagonist Momonga decides to not log out. Momonga is then transformed into the image of a skeleton as \"the most powerful wizard.\" The world continues to change, with non-player characters (NPCs) beginning to feel emotion. Having no parents, friends, or place in society, this ordinary young man Momonga then strives to take over the new world the game has become.",
    "numOfEp": 13,
    "numOfSeasons": 4,
    "type": "TV",
    "shortCode": "OVRL",
    "rating": 76,
    "year": 2015,
    "studio": "MADHOUSE",
    "genres":[
      "ACTION",
      "ADVENTURE",
      "FANTASY"
    ]
  },
  {
    "title": "Tensei shitara Slime Datta Ken",
    "desc": "Lonely thirty-seven-year-old Satoru Mikami is stuck in a dead-end job, unhappy with his mundane life, but after dying at the hands of a robber, he awakens to a fresh start in a fantasy realm...as a slime monster! As he acclimates to his goopy new existence, his exploits with the other monsters set off a chain of events that will change his new world forever!",
    "numOfEp": 24,
    "numOfSeasons": 2,
    "type": "TV",
    "shortCode": "SLIME",
    "rating": 80,
    "year": 2018,
    "studio": "8BIT",
    "genres":[
      "ACTION",
      "ADVENTURE",
      "COMEDY",
      "FANTASY"
    ]
  },
  {
    "title": "Ningen Fushin: Adventurers Who Don't Believe in Humanity Will Save the World",
    "desc": "Nick used to be a member of a veteran adventurer party, helping his undisciplined friends with the accounts whenever he could. But what was his reward? Getting accused of embezzlement and kicked out by the leader he respected. Before long, he finds a few other jaded adventurers and kindred spirits, and together, they form their own unstoppable party!",
    "numOfEp": 12,
    "numOfSeasons": 1,
    "type": "TV",
    "shortCode": "NFNO",
    "rating": 63,
    "year": 2022,
    "studio": "GEEKTOYS",
    "genres":[
      "ACTION",
      "ADVENTURE",
      "FANTASY"
    ]
  },
  {
    "title": "BLUELOCK",
    "desc": "After a disastrous defeat at the 2018 World Cup, Japan's team struggles to regroup. But what's missing? An absolute Ace Striker, who can guide them to the win. The Japan Football Union is hell-bent on creating a striker who hungers for goals and thirsts for victory, and who can be the decisive instrument in turning around a losing match...and to do so, they've gathered 300 of Japan's best and brightest youth players. Who will emerge to lead the team...and will they be able to out-muscle and out-ego everyone who stands in their way?",
    "numOfEp": 24,
    "numOfSeasons": 1,
    "type": "TV",
    "shortCode": "BL",
    "rating": 81,
    "year": 2023,
    "studio": "8BIT",
    "genres":[
      "ACTION",
      "DRAMA",
      "SPORTS"
    ]
  },
  {
    "title": "The Eminence in Shadow",
    "desc": "Some people just aren't suited to playing the part of the flashy, in-your-face hero or the dastardly, mustache-twirling villain with larger-than-life panache. Instead, they operate in the shadows and pull the strings of society through wit and cleverness. That’s the role Cid wants to play when he's transported to another world. Cid spins a yarn or three and becomes the unlikely leader of the underground Shadow Garden organization that fights against a menacing cult (which he totally made up). However, there's a catch even his wild imagination didn't see coming: the cult he concocted actually exists, and they're beyond displeased that his power fantasy just got in the way of their evil plans!",
    "numOfEp": 20,
    "numOfSeasons": 1,
    "type": "TV",
    "shortCode": "SHADOW",
    "rating": 82,
    "year": 2022,
    "studio": "NEXUS",
    "genres":[
      "ACTION",
      "COMEDY",
      "FANTASY"
    ]
  },
  {
    "title": "The Misfit of Demon King Academy: History's Strongest Demon King Reincarnates and Goes to School with His Descendants",
    "desc": "Anos, the Demon King of Tyranny, has defeated humans, spirits, and gods alike. But even demon kings get tired of all the fighting sometimes! Hoping for a more peaceful life, Anos decides to reincarnate himself. When he wakes two thousand years later, though, he finds the world has become too peaceful--his descendants have grown weak and magic is in serious decline. Intending to reclaim his rightful place, he enrolls in Demon King Academy, where he finds that his magical power is off the charts. Literally. And because they can't measure his power, the faculty and other students regard Anos as a misfit. With the support of Misha, the one student he manages to befriend, the misfit (Demon King) begins his climb up the demon ranks!",
    "numOfEp": 13,
    "numOfSeasons": 2,
    "type": "TV",
    "shortCode": "TMODKA",
    "rating": 73,
    "year": 2023,
    "studio": "SILVER",
    "genres":[
      "ACTION",
      "FANTASY"
    ]
  },
  {
    "title": "Boku no Hero Academia",
    "desc": "What would the world be like if 80 percent of the population manifested extraordinary superpowers called “Quirks” at age four? Heroes and villains would be battling it out everywhere! Becoming a hero would mean learning to use your power, but where would you go to study? U.A. High's Hero Program of course! But what would you do if you were one of the 20 percent who were born Quirkless?",
    "numOfEp": 13,
    "numOfSeasons": 6,
    "type": "TV",
    "shortCode": "BNHA",
    "rating": 77,
    "year": 2016,
    "studio": "BONES",
    "genres":[
      "ACTION",
      "ADVENTURE",
      "COMEDY"
    ]
  },
  {
    "title": "Fullmetal Alchemist: Brotherhood",
    "desc": "Alchemy is bound by this Law of Equivalent Exchange—something the young brothers Edward and Alphonse Elric only realize after attempting human transmutation: the one forbidden act of alchemy. They pay a terrible price for their transgression—Edward loses his left leg, Alphonse his physical body. It is only by the desperate sacrifice of Edward's right arm that he is able to affix Alphonse's soul to a suit of armor. Devastated and alone, it is the hope that they would both eventually return to their original bodies that gives Edward the inspiration to obtain metal limbs called \"automail\" and become a state alchemist, the Fullmetal Alchemist.",
    "numOfEp": 64,
    "numOfSeasons": 1,
    "type": "TV",
    "shortCode": "FAB",
    "rating": 90,
    "year": 2009,
    "studio": "BONES",
    "genres":[
      "ACTION",
      "ADVENTURE",
      "DRAMA",
      "FANTASY"
    ]
  },
  {
    "title": "Hunter x Hunter (2011)",
    "desc": "A Hunter is one who travels the world doing all sorts of dangerous tasks. From capturing criminals to searching deep within uncharted lands for any lost treasures. Gon is a young boy whose father disappeared long ago, being a Hunter. He believes if he could also follow his father's path, he could one day reunite with him. After becoming 12, Gon leaves his home and takes on the task of entering the Hunter exam, notorious for its low success rate and high probability of death to become an official Hunter. He befriends the revenge-driven Kurapika, the doctor-to-be Leorio and the rebellious ex-assassin Killua in the exam, with their friendship prevailing throughout the many trials and threats they come upon taking on the dangerous career of a Hunter.",
    "numOfEp": 148,
    "numOfSeasons": 1,
    "type": "TV",
    "shortCode": "HXH",
    "rating": 89,
    "year": 2011,
    "studio": "MADHOUSE",
    "genres":[
      "ACTION",
      "ADVENTURE",
      "FANTASY"
    ]
  },
  {
    "title": "Vinland Saga",
    "desc": "Thorfinn is son to one of the Vikings' greatest warriors, but when his father is killed in battle by the mercenary leader Askeladd, he swears to have his revenge. Thorfinn joins Askeladd's band in order to challenge him to a duel, and ends up caught in the middle of a war for the crown of England.",
    "numOfEp": 24,
    "numOfSeasons": 2,
    "type": "TV",
    "shortCode": "VS",
    "rating": 87,
    "year": 2019,
    "studio": "WIT",
    "genres":[
      "ACTION",
      "DRAMA",
      "ADVENTURE"
    ]
  },
  {
    "title": "CYBERPUNK: EDGERUNNERS",
    "desc": "CYBERPUNK: EDGERUNNERS tells a standalone, 10-episode story about a street kid trying to survive in a technology and body modification-obsessed city of the future. Having everything to lose, he chooses to stay alive by becoming an edgerunner—a mercenary outlaw also known as a cyberpunk.",
    "numOfEp": 10,
    "numOfSeasons": 1,
    "type": "ONA",
    "shortCode": "CE",
    "rating": 85,
    "year": 2022,
    "studio": "TRIGGER",
    "genres":[
      "ACTION",
      "DRAMA",
      "PSYCHOLOGICAL",
      "SCI-FI"
    ]
  },
  {
    "title": "JUJUTSU KAISEN",
    "desc": "Hardship, regret, shame: the negative feelings that humans feel become Curses that lurk in our everyday lives. The Curses run rampant throughout the world, capable of leading people to terrible misfortune and even death. What's more, the Curses can only be exorcised by another Curse. Itadori Yuji is a boy with tremendous physical strength, though he lives a completely ordinary high school life. One day, to save a friend who has been attacked by Curses, he eats the finger of the Double-Faced Specter, taking the Curse into his own soul. From then on, he shares one body with the Double-Faced Specter. Guided by the most powerful of sorcerers, Gojou Satoru, Itadori is admitted to the Tokyo Metropolitan Technical High School of Sorcery, an organization that fights the Curses... and thus begins the heroic tale of a boy who became a Curse to exorcise a Curse, a life from which he could never turn back.",
    "numOfEp": 24,
    "numOfSeasons": 1,
    "type": "TV",
    "shortCode": "JK",
    "rating": 86,
    "year": 2020,
    "studio": "MAPPA",
    "genres":[
      "ACTION",
      "DRAMA",
      "SUPERNATURAL"
    ]
  },
  {
    "title": "The Promised Neverland",
    "desc": "Emma, Norman and Ray are the brightest kids at the Grace Field House orphanage. And under the care of the woman they refer to as “Mom,” all the kids have enjoyed a comfortable life. Good food, clean clothes and the perfect environment to learn—what more could an orphan ask for? One day, though, Emma and Norman uncover the dark truth of the outside world they are forbidden from seeing.",
    "numOfEp": 12,
    "numOfSeasons": 2,
    "type": "TV",
    "shortCode": "TPN",
    "rating": 84,
    "year": 2019,
    "studio": "CLOVERWORKS",
    "genres":[
      "DRAMA",
      "FANTASY",
      "HORROR",
      "MYSTERY",
      "PSYCHOLOGICAL",
      "THRILLER"
    ]
  },
  {
    "title": "Death Note",
    "desc": "Light Yagami is a genius high school student who is about to learn about life through a book of death. When a bored shinigami, a God of Death, named Ryuk drops a black notepad called a Death Note, Light receives power over life and death with the stroke of a pen. Determined to use this dark gift for the best, Light sets out to rid the world of evil… namely, the people he believes to be evil. Should anyone hold such power?",
    "numOfEp": 37,
    "numOfSeasons": 1,
    "type": "TV",
    "shortCode": "DN",
    "rating": 84,
    "year": 2006,
    "studio": "MADHOUSE",
    "genres":[
      "MYSTERY",
      "PSYCHOLOGICAL",
      "SUPERNATURAL",
      "THRILLER"
    ]
  },
  {
    "title": "The Disastrous Life of Saiki K.",
    "desc": "To the average person, psychic abilities might seem a blessing; for Kusuo Saiki, however, this couldn't be further from the truth. Gifted with a wide assortment of supernatural abilities ranging from telepathy to x-ray vision, he finds this so-called blessing to be nothing but a curse. As all the inconveniences his powers cause constantly pile up, all Kusuo aims for is an ordinary, hassle-free life—a life where ignorance is bliss. Unfortunately, the life of a psychic is far from quiet. Though Kusuo tries to stay out of the spotlight by keeping his powers a secret from his classmates, he ends up inadvertently attracting the attention of many odd characters, such as the empty-headed Riki Nendou and the delusional Shun Kaidou. Forced to deal with the craziness of the people around him, Kusuo comes to learn that the ordinary life he has been striving for is a lot more difficult to achieve than expected.",
    "numOfEp": 120,
    "numOfSeasons": 2,
    "type": "TV",
    "shortCode": "TDLOSK",
    "rating": 83,
    "year": 2016,
    "studio": "EGG FIRM",
    "genres":[
      "COMEDY",
      "SLICE OF LiFE",
      "SUPERNATURAL"
    ]
  },
  {
    "title": "Mushoku Tensei: Jobless Reincarnation",
    "desc": "When a 34-year-old underachiever gets run over by a bus, his story doesn’t end there. Reincarnated in a new world as an infant, Rudeus will seize every opportunity to live the life he’s always wanted. Armed with new friends, some freshly acquired magical abilities, and the courage to do the things he’s always dreamed of, he’s embarking on an epic adventure—with all of his past experience intact!",
    "numOfEp": 11,
    "numOfSeasons": 2,
    "type": "TV",
    "shortCode": "MTJR",
    "rating": 82,
    "year": 2021,
    "studio": "BIND",
    "genres":[
      "ADVENTURE",
      "DRAMA",
      "ECCHI",
      "FANTASY"
    ]
  },
  {
    "title": "Steins;Gate",
    "desc": "Self-proclaimed mad scientist Okabe Rintarou lives in a small room in Akihabara, where he invents \"future gadgets\" with fellow lab members Shiina Mayuri, his air-headed childhood friend, and Hashida Itaru, an otaku hacker. The three pass the time by tinkering with their latest creation, a \"Phone Microwave\" that can be controlled through text messages. The lab members soon face a string of mysterious incidents that lead to a game-changing discovery: the Phone Microwave can send emails to the past and thus alter history. Adapted from the critically acclaimed visual novel by 5pb. and Nitroplus, Steins;Gate takes Okabe to the depths of scientific theory and human despair as he faces the dire consequences of changing the past",
    "numOfEp": 24,
    "numOfSeasons": 2,
    "type": "TV",
    "shortCode": "SG",
    "rating": 89,
    "year": 2011,
    "studio": "WHITE FOX",
    "genres":[
      "DRAMA",
      "PSYCHOLOGICAL",
      "SCI-FI",
      "THRILLER"
    ]
  },
  {
    "title": "Bleach",
    "desc": "Ichigo Kurosaki is a rather normal high school student apart from the fact he has the ability to see ghosts. This ability never impacted his life in a major way until the day he encounters the Shinigami Kuchiki Rukia, who saves him and his family's lives from a Hollow, a corrupt spirit that devours human souls. Wounded during the fight against the Hollow, Rukia chooses the only option available to defeat the monster and passes her Shinigami powers to Ichigo. Now forced to act as a substitute until Rukia recovers, Ichigo hunts down the Hollows that plague his town.",
    "numOfEp": 366,
    "numOfSeasons": 2,
    "type": "TV",
    "shortCode": "BLEACH",
    "rating": 77,
    "year": 2012,
    "studio": "PIEROT",
    "genres":[
      "ACTION",
      "ADVENTURE",
      "SUPERNATURAL"
    ]
  }
]