[
  {
    "title": "Chainsaw Man",
    "desc": "Denji is a teenage boy living with a Chainsaw Devil named Pochita. Due to the debt his father left behind, he has been living a rock-bottom life while repaying his debt by harvesting devil corpses with Pochita. One day, Denji is betrayed and killed. As his consciousness fades, he makes a contract with Pochita and gets revived as \"Chainsaw Man\" — a man with a devil's heart.",
    "numOfEp": 12,
    "numOfSeasons": 1,
    "type": "TV",
    "shortCode": "CM",
    "rating": 86,
    "year": 2022,
    "studio": "MAPPA",
    "genres":[
      "ACTION",
      "COMEDY",
      "DRAMA",
      "HORROR",
      "SUPERNATURAL"
    ]
  },
  {
    "title": "One Piece",
    "desc": "Enter Monkey D. Luffy, a 17-year-old boy that defies your standard definition of a pirate. Rather than the popular persona of a wicked, hardened, toothless pirate who ransacks villages for fun, Luffy’s reason for being a pirate is one of pure wonder; the thought of an exciting adventure and meeting new and intriguing people, along with finding One Piece, are his reasons of becoming a pirate. Following in the footsteps of his childhood hero, Luffy and his crew travel across the Grand Line, experiencing crazy adventures, unveiling dark mysteries and battling strong enemies, all in order to reach One Piece.",
    "numOfEp": 1054,
    "numOfSeasons": 1,
    "type": "TV",
    "shortCode": "OP",
    "rating": 87,
    "year": 1999,
    "studio": "TOEI",
    "genres":[
      "ACTION",
      "ADVENTURE",
      "COMEDY",
      "DRAMA",
      "FANTASY"
    ]
  },
  {
    "title": "Overlord",
    "desc": "The story takes place in the year 2138 when virtual reality gaming is booming. Yggdrasil, a popular online game is quietly shut down one day. However, the protagonist Momonga decides to not log out. Momonga is then transformed into the image of a skeleton as \"the most powerful wizard.\" The world continues to change, with non-player characters (NPCs) beginning to feel emotion. Having no parents, friends, or place in society, this ordinary young man Momonga then strives to take over the new world the game has become.",
    "numOfEp": 13,
    "numOfSeasons": 4,
    "type": "TV",
    "shortCode": "OVRL",
    "rating": 76,
    "year": 2015,
    "studio": "MADHOUSE",
    "genres":[
      "ACTION",
      "ADVENTURE",
      "FANTASY"
    ]
  },
  {
    "title": "Tensei shitara Slime Datta Ken",
    "desc": "Lonely thirty-seven-year-old Satoru Mikami is stuck in a dead-end job, unhappy with his mundane life, but after dying at the hands of a robber, he awakens to a fresh start in a fantasy realm...as a slime monster! As he acclimates to his goopy new existence, his exploits with the other monsters set off a chain of events that will change his new world forever!",
    "numOfEp": 24,
    "numOfSeasons": 2,
    "type": "TV",
    "shortCode": "SLIME",
    "rating": 80,
    "year": 2018,
    "studio": "8BIT",
    "genres":[
      "ACTION",
      "ADVENTURE",
      "COMEDY",
      "FANTASY"
    ]
  },
  {
    "title": "Ningen Fushin: Adventurers Who Don't Believe in Humanity Will Save the World",
    "desc": "Nick used to be a member of a veteran adventurer party, helping his undisciplined friends with the accounts whenever he could. But what was his reward? Getting accused of embezzlement and kicked out by the leader he respected. Before long, he finds a few other jaded adventurers and kindred spirits, and together, they form their own unstoppable party!",
    "numOfEp": 12,
    "numOfSeasons": 1,
    "type": "TV",
    "shortCode": "NFNO",
    "rating": 63,
    "year": 2022,
    "studio": "GEEKTOYS",
    "genres":[
      "ACTION",
      "ADVENTURE",
      "FANTASY"
    ]
  },
  {
    "title": "BLUELOCK",
    "desc": "After a disastrous defeat at the 2018 World Cup, Japan's team struggles to regroup. But what's missing? An absolute Ace Striker, who can guide them to the win. The Japan Football Union is hell-bent on creating a striker who hungers for goals and thirsts for victory, and who can be the decisive instrument in turning around a losing match...and to do so, they've gathered 300 of Japan's best and brightest youth players. Who will emerge to lead the team...and will they be able to out-muscle and out-ego everyone who stands in their way?",
    "numOfEp": 24,
    "numOfSeasons": 1,
    "type": "TV",
    "shortCode": "BL",
    "rating": 81,
    "year": 2023,
    "studio": "8BIT",
    "genres":[
      "ACTION",
      "DRAMA",
      "SPORTS"
    ]
  },
  {
    "title": "The Eminence in Shadow",
    "desc": "Some people just aren't suited to playing the part of the flashy, in-your-face hero or the dastardly, mustache-twirling villain with larger-than-life panache. Instead, they operate in the shadows and pull the strings of society through wit and cleverness. That’s the role Cid wants to play when he's transported to another world. Cid spins a yarn or three and becomes the unlikely leader of the underground Shadow Garden organization that fights against a menacing cult (which he totally made up). However, there's a catch even his wild imagination didn't see coming: the cult he concocted actually exists, and they're beyond displeased that his power fantasy just got in the way of their evil plans!",
    "numOfEp": 20,
    "numOfSeasons": 1,
    "type": "TV",
    "shortCode": "SHADOW",
    "rating": 82,
    "year": 2022,
    "studio": "NEXUS",
    "genres":[
      "ACTION",
      "COMEDY",
      "FANTASY"
    ]
  },
  {
    "title": "The Misfit of Demon King Academy: History's Strongest Demon King Reincarnates and Goes to School with His Descendants",
    "desc": "Anos, the Demon King of Tyranny, has defeated humans, spirits, and gods alike. But even demon kings get tired of all the fighting sometimes! Hoping for a more peaceful life, Anos decides to reincarnate himself. When he wakes two thousand years later, though, he finds the world has become too peaceful--his descendants have grown weak and magic is in serious decline. Intending to reclaim his rightful place, he enrolls in Demon King Academy, where he finds that his magical power is off the charts. Literally. And because they can't measure his power, the faculty and other students regard Anos as a misfit. With the support of Misha, the one student he manages to befriend, the misfit (Demon King) begins his climb up the demon ranks!",
    "numOfEp": 13,
    "numOfSeasons": 2,
    "type": "TV",
    "shortCode": "TMODKA",
    "rating": 73,
    "year": 2023,
    "studio": "SILVER",
    "genres":[
      "ACTION",
      "FANTASY"
    ]
  },
  {
    "title": "Boku no Hero Academia",
    "desc": "What would the world be like if 80 percent of the population manifested extraordinary superpowers called “Quirks” at age four? Heroes and villains would be battling it out everywhere! Becoming a hero would mean learning to use your power, but where would you go to study? U.A. High's Hero Program of course! But what would you do if you were one of the 20 percent who were born Quirkless?",
    "numOfEp": 13,
    "numOfSeasons": 6,
    "type": "TV",
    "shortCode": "BNHA",
    "rating": 77,
    "year": 2016,
    "studio": "BONES",
    "genres":[
      "ACTION",
      "ADVENTURE",
      "COMEDY"
    ]
  }
]